Revit 2027 API
ParameterTypeId.ContinuousrailEndExtensionLengthParam Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailEndExtensionLengthParam { get; }
Public Shared ReadOnly Property ContinuousrailEndExtensionLengthParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailEndExtensionLengthParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailEndExtensionLengthParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace